<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Handbrake</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Handbrake</string>
		<key>NAME</key>
		<string>Handbrake</string>
		<key>PRERELEASE</key>
		<string></string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>HandBrake is a tool for converting video from nearly any format to a selection of modern, widely supported codecs.</string>
			<key>display_name</key>
			<string>Handbrake</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.Handbrake</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.Handbrake</key>
			<dict>
				<key>git_hash</key>
				<string>e03eb4736e1128f6caf6cae433e0450e90a1dbaf</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Handbrake/Handbrake.download.recipe</string>
				<key>sha256_hash</key>
				<string>82890e3929a879d44b03a6b4cbd99647169b83899fdad9a693d7ff4f3557ec41</string>
			</dict>
			<key>com.github.autopkg.munki.Handbrake</key>
			<dict>
				<key>git_hash</key>
				<string>5011cb739ce9caa6c4f13d7ea2342ec5205f8f08</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Handbrake/Handbrake.munki.recipe</string>
				<key>sha256_hash</key>
				<string>d7d2119f6ce67c0f7e72c51f89a91df7864fa0215b98c9016b73c80d250da889</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
