<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Puppet</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>support/Puppetlabs/Puppet</string>
		<key>NAME</key>
		<string>Puppet</string>
		<key>VERSION</key>
		<string>latest</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>production</string>
			</array>
			<key>description</key>
			<string>Puppet is a tool designed to manage the configuration of Unix-like and Microsoft Windows systems declaratively.</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>Facter</string>
				<string>Hiera</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.puppet</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>PuppetlabsProductsURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>8574c91661dc067f31a486239fd8f5685c6f4fa0</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Puppetlabs/PuppetlabsProductsURLProvider.py</string>
				<key>sha256_hash</key>
				<string>f327c3286ddba168789a4c39b5d9eb8abdbeedaff3d1dd98f4681096f19701d5</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.puppet</key>
			<dict>
				<key>git_hash</key>
				<string>55e47128864841e568cf20ccd2b852fea48faa50</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Puppetlabs/Puppet.download.recipe</string>
				<key>sha256_hash</key>
				<string>f60c76ffc0aca833c75055557d02536a369ef4ea733755c7b8d7efdbd1dc7d4c</string>
			</dict>
			<key>com.github.autopkg.munki.puppet</key>
			<dict>
				<key>git_hash</key>
				<string>f7f420112ba0e42640bb188f378d2137bb09d2f1</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Puppetlabs/Puppet.munki.recipe</string>
				<key>sha256_hash</key>
				<string>a879c8ed7317599a20c7f66e864d8e690e0ed3f2d55e336b02b1df0d0995ef70</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
