<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.TheUnarchiver</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/MacPaw</string>
		<key>NAME</key>
		<string>TheUnarchiver</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://updates.devmate.com/com.macpaw.site.theunarchiver.xml</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>production</string>
			</array>
			<key>description</key>
			<string>The Unarchiver is a much more capable replacement for "Archive Utility.app", the built-in archive unpacker program on Mac OS X. The Unarchiver is designed to handle many more formats than Archive Utility, and to better fit in with the design of the Finder.</string>
			<key>display_name</key>
			<string>The Unarchiver</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
		<key>pkginfo_keys_to_copy_from_sparkle_feed</key>
		<array>
			<string>minimum_os_version</string>
		</array>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.TheUnarchiver</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.TheUnarchiver</key>
			<dict>
				<key>git_hash</key>
				<string>4c42f36018949ce59178d691bca7ce8a45d8c051</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/The Unarchiver/TheUnarchiver.download.recipe</string>
				<key>sha256_hash</key>
				<string>d51ce7285a2d14b9643fc516b870958f1bdbe9a0fd9a5a426081e94a97d259de</string>
			</dict>
			<key>com.github.autopkg.munki.TheUnarchiver</key>
			<dict>
				<key>git_hash</key>
				<string>3241629e0afa554fea7eeaf211b7e912ed75066b</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/The Unarchiver/TheUnarchiver.munki.recipe</string>
				<key>sha256_hash</key>
				<string>2060af1b31867a607da2cfee1001ed19e1cc7bb7ce195fe137c97790dd469c21</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
