<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Xcode</string>
	<key>Input</key>
	<dict>
		<key>APPLE_ID</key>
		<string>dev@domain.com</string>
		<key>BETA</key>
		<string></string>
		<key>DESTINATION_APP_NAME</key>
		<string>Xcode.app</string>
		<key>ICON_NAME</key>
		<string>Xcode.png</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Apple/Xcode/</string>
		<key>NAME</key>
		<string>Xcode</string>
		<key>NOSKIP</key>
		<string></string>
		<key>PASSWORD</key>
		<string>password</string>
		<key>PASSWORD_FILE</key>
		<string>secret.txt</string>
		<key>PATTERN</key>
		<string>(.*\/Xcode_.*\/Xcode.*.xip)</string>
		<key>VERSION_EMIT_PATH</key>
		<string>%RECIPE_CACHE_DIR%/xcode_tag</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Xcode</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.facebook.autopkg.xcode.munki</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>AppleCookieDownloader</key>
			<dict>
				<key>git_hash</key>
				<string>a7ef4c46bbfe5c73825c9bff184f2bb8205e2830</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/AppleCookieDownloader.py</string>
				<key>sha256_hash</key>
				<string>bbb11f0c1985f24ab639b4867a66af91fbf33a6bdadb7d6ae846407e0804ad99</string>
			</dict>
			<key>AppleDataGatherer</key>
			<dict>
				<key>git_hash</key>
				<string>a7ef4c46bbfe5c73825c9bff184f2bb8205e2830</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/AppleDataGatherer.py</string>
				<key>sha256_hash</key>
				<string>e6627f38b3b7ded0822e686ef80c151fa8fcbd697292120f6addb24202f6e567</string>
			</dict>
			<key>AppleURLSearcher</key>
			<dict>
				<key>git_hash</key>
				<string>a7ef4c46bbfe5c73825c9bff184f2bb8205e2830</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/AppleURLSearcher.py</string>
				<key>sha256_hash</key>
				<string>197987c0f40bf59fa22daaef2283795a70255d3d73b258d25e9458ba883b88c4</string>
			</dict>
			<key>XcodeVersionEmitter</key>
			<dict>
				<key>git_hash</key>
				<string>a7ef4c46bbfe5c73825c9bff184f2bb8205e2830</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/XcodeVersionEmitter.py</string>
				<key>sha256_hash</key>
				<string>5b210656a19494176d9040b5f72736284e51e759a2f0b89a886c730b745b0afa</string>
			</dict>
			<key>XcodeVersioner</key>
			<dict>
				<key>git_hash</key>
				<string>a7ef4c46bbfe5c73825c9bff184f2bb8205e2830</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/XcodeVersioner.py</string>
				<key>sha256_hash</key>
				<string>bc84ff3e9ad83936d3160012c7e85e534806c1fc4a9bef0fd5394247d38eae35</string>
			</dict>
			<key>XcodeXIPUnpacker</key>
			<dict>
				<key>git_hash</key>
				<string>a7ef4c46bbfe5c73825c9bff184f2bb8205e2830</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/XcodeXIPUnpacker.py</string>
				<key>sha256_hash</key>
				<string>88828d954a9084e7b157c86068e153dc908ba6012a0e7294082f70e05c4b6cb9</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.facebook.autopkg.xcode.downloader</key>
			<dict>
				<key>git_hash</key>
				<string>15dba4a03729cd2d0c4fbc0372817e3a2c80e50d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/Xcode.download.recipe</string>
				<key>sha256_hash</key>
				<string>902bbe55664a3c4d4ad2335b1b0cb4d766a8484da5e2f3d8d383bfaa8919eb44</string>
			</dict>
			<key>com.facebook.autopkg.xcode.extract</key>
			<dict>
				<key>git_hash</key>
				<string>15dba4a03729cd2d0c4fbc0372817e3a2c80e50d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/Xcode.extract.recipe</string>
				<key>sha256_hash</key>
				<string>8742a7a120fd40f2e1d70a2f064f35b9fd24890874a7ca56115eaa38653d3998</string>
			</dict>
			<key>com.facebook.autopkg.xcode.munki</key>
			<dict>
				<key>git_hash</key>
				<string>15dba4a03729cd2d0c4fbc0372817e3a2c80e50d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.facebook.Recipes-for-AutoPkg/Xcode/Xcode.munki.recipe</string>
				<key>sha256_hash</key>
				<string>f2bc53e5f24225787de7bc67831d3f2a68656ecb79be10698c0150dd2da5e5fe</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
